In [128]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")
from sklearn.preprocessing import *

In [68]:
business = pd.read_csv("business.csv")
economy = pd.read_csv("economy.csv")
df_cleaned = pd.read_csv("Clean_Dataset.csv")

In [69]:
economy

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953"
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953"
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956"
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955"
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955"
...,...,...,...,...,...,...,...,...,...,...,...
206769,31-03-2022,Vistara,UK,832,07:05,Chennai,13h 50m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:55,Hyderabad,"7,697"
206770,31-03-2022,Vistara,UK,832,07:05,Chennai,13h 50m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:55,Hyderabad,"7,709"
206771,31-03-2022,Vistara,UK,826,12:30,Chennai,20h 35m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,09:05,Hyderabad,"8,640"
206772,31-03-2022,Vistara,UK,822,09:45,Chennai,23h 20m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,09:05,Hyderabad,"8,640"
206773,31-03-2022,Vistara,UK,824,20:30,Chennai,24h 25m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:55,Hyderabad,"8,640"

In [70]:
df_cleaned

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...,...
300148,300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265
300149,300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105
300150,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099
300151,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585

In [71]:
extra_airlines = []
for i in economy["airline"].unique():
    if " " in i:
        k = i.replace(" ","_")
    else:
        k = i
    if k not in df_cleaned["airline"].unique():
        extra_airlines.append(k)

In [72]:
extra_airlines

['Trujet', 'StarAir']

In [79]:
df_cleaned_1 = df_cleaned.drop(columns="Unnamed: 0")

In [82]:
pp = False
for i in extra_airlines:
    pp = (pp  | (economy["airline"] == i))
qq = economy[pp].copy().reset_index(drop=True).drop(columns="date")
qq_1 = qq.copy()
qq_1["flight"] = list(map((lambda x,y: x + "-" + str(y)),qq["ch_code"],qq["num_code"]))
qq_2 = qq_1.drop(columns=["ch_code","num_code"])
qq_2["class"] = "Economy"
qq_2["days_left"] = np.nan
col_dict = {
    "from":"source_city",
    "dep_time":"departure_time",
    "stop":"stops",
    "arr_time":"arrival_time",
    "to":"destination_city",
    "time_taken":"duration",
}
qq_2 = qq_2.rename(columns=col_dict)
qq_2 = qq_2[df_cleaned_1.columns.values]
qq_2

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,Trujet,2T-518,Mumbai,11:40,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,19:00,Hyderabad,Economy,7h 20m,NaN,"3,166"
1,Trujet,2T-518,Mumbai,11:40,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,19:00,Hyderabad,Economy,7h 20m,NaN,"3,166"
2,Trujet,2T-518,Mumbai,11:40,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,19:00,Hyderabad,Economy,7h 20m,NaN,"3,166"
3,Trujet,2T-518,Mumbai,11:40,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,19:00,Hyderabad,Economy,7h 20m,NaN,"3,166"
4,Trujet,2T-518,Mumbai,11:40,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,19:00,Hyderabad,Economy,7h 20m,NaN,"3,166"
...,...,...,...,...,...,...,...,...,...,...,...
97,Trujet,2T-623,Hyderabad,08:35,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,11:00,Bangalore,Economy,2h 25m,NaN,"3,196"
98,StarAir,S5-152,Hyderabad,20:20,non-stop,21:25,Bangalore,Economy,01h 05m,NaN,"2,115"
99,Trujet,2T-623,Hyderabad,08:35,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,11:00,Bangalore,Economy,2h 25m,NaN,"3,196"
100,StarAir,S5-152,Hyderabad,20:20,non-stop,21:25,Bangalore,Economy,01h 05m,NaN,"2,115"
101,StarAir,S5-152,Hyderabad,20:20,non-stop,21:25,Bangalore,Economy,01h 05m,NaN,"2,115"

In [88]:
def convert_time_to_phases(hr):
    phase = ""
    if hr in range(0,4):
        phase = "Late_Night"
    elif hr in range(4,8):
        phase = "Early_Morning"
    elif hr in range(8,12):
        phase = "Morning"
    elif hr in range(12,16):
        phase = "Afternoon"
    elif hr in range(16,20):
        phase = "Evening"
    elif hr in range(20,24):
        phase = "Night"
    return phase

In [89]:
qq_3 = qq_2.copy()
a = pd.to_datetime(qq_2["departure_time"]).dt.hour
b = pd.to_datetime(qq_2["arrival_time"]).dt.hour
qq_3["departure_time"] = list(map(lambda x: convert_time_to_phases(x),a))
qq_3["arrival_time"] = list(map(lambda x: convert_time_to_phases(x),b))
qq_3

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,Trujet,2T-518,Mumbai,Morning,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,Evening,Hyderabad,Economy,7h 20m,NaN,"3,166"
1,Trujet,2T-518,Mumbai,Morning,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,Evening,Hyderabad,Economy,7h 20m,NaN,"3,166"
2,Trujet,2T-518,Mumbai,Morning,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,Evening,Hyderabad,Economy,7h 20m,NaN,"3,166"
3,Trujet,2T-518,Mumbai,Morning,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,Evening,Hyderabad,Economy,7h 20m,NaN,"3,166"
4,Trujet,2T-518,Mumbai,Morning,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,Evening,Hyderabad,Economy,7h 20m,NaN,"3,166"
...,...,...,...,...,...,...,...,...,...,...,...
97,Trujet,2T-623,Hyderabad,Morning,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,Morning,Bangalore,Economy,2h 25m,NaN,"3,196"
98,StarAir,S5-152,Hyderabad,Night,non-stop,Night,Bangalore,Economy,01h 05m,NaN,"2,115"
99,Trujet,2T-623,Hyderabad,Morning,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,Morning,Bangalore,Economy,2h 25m,NaN,"3,196"
100,StarAir,S5-152,Hyderabad,Night,non-stop,Night,Bangalore,Economy,01h 05m,NaN,"2,115"
101,StarAir,S5-152,Hyderabad,Night,non-stop,Night,Bangalore,Economy,01h 05m,NaN,"2,115"

In [99]:
qq_4 = qq_3.copy()
qq_4["stops"] = list(map(lambda x: x.replace("\n","").replace("\t",""),qq_3["stops"]))
qq_4["duration"].unique()
def clean_time(ti):
    ti = ti.split(" ")
    hr = float(ti[0].replace("h",""))
    min = float(ti[1].replace("m",""))
    total_time = round((hr + (min/60)),2)
    return total_time
qq_4["duration"] = list(map(lambda x: clean_time(x),qq_3["duration"]))
qq_4["price"] = list(map(lambda x: int(x.replace(",","")),qq_3["price"]))
qq_4

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,Trujet,2T-518,Mumbai,Morning,1-stop,Evening,Hyderabad,Economy,7.33,NaN,3166
1,Trujet,2T-518,Mumbai,Morning,1-stop,Evening,Hyderabad,Economy,7.33,NaN,3166
2,Trujet,2T-518,Mumbai,Morning,1-stop,Evening,Hyderabad,Economy,7.33,NaN,3166
3,Trujet,2T-518,Mumbai,Morning,1-stop,Evening,Hyderabad,Economy,7.33,NaN,3166
4,Trujet,2T-518,Mumbai,Morning,1-stop,Evening,Hyderabad,Economy,7.33,NaN,3166
...,...,...,...,...,...,...,...,...,...,...,...
97,Trujet,2T-623,Hyderabad,Morning,1-stop,Morning,Bangalore,Economy,2.42,NaN,3196
98,StarAir,S5-152,Hyderabad,Night,non-stop,Night,Bangalore,Economy,1.08,NaN,2115
99,Trujet,2T-623,Hyderabad,Morning,1-stop,Morning,Bangalore,Economy,2.42,NaN,3196
100,StarAir,S5-152,Hyderabad,Night,non-stop,Night,Bangalore,Economy,1.08,NaN,2115
101,StarAir,S5-152,Hyderabad,Night,non-stop,Night,Bangalore,Economy,1.08,NaN,2115

In [109]:
df = pd.concat([df_cleaned_1,qq_4],axis=0,ignore_index=True).reset_index()
df["days_left"] = df["days_left"].fillna(df["days_left"].median())
df

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1.0,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1.0,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1.0,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1.0,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1.0,5955
...,...,...,...,...,...,...,...,...,...,...,...,...
300250,300250,Trujet,2T-623,Hyderabad,Morning,1-stop,Morning,Bangalore,Economy,2.42,26.0,3196
300251,300251,StarAir,S5-152,Hyderabad,Night,non-stop,Night,Bangalore,Economy,1.08,26.0,2115
300252,300252,Trujet,2T-623,Hyderabad,Morning,1-stop,Morning,Bangalore,Economy,2.42,26.0,3196
300253,300253,StarAir,S5-152,Hyderabad,Night,non-stop,Night,Bangalore,Economy,1.08,26.0,2115
300254,300254,StarAir,S5-152,Hyderabad,Night,non-stop,Night,Bangalore,Economy,1.08,26.0,2115

In [110]:
df_1 = df.drop(columns=["index","airline","flight"])
df_1

,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1.0,5953
1,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1.0,5953
2,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1.0,5956
3,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1.0,5955
4,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1.0,5955
...,...,...,...,...,...,...,...,...,...
300250,Hyderabad,Morning,1-stop,Morning,Bangalore,Economy,2.42,26.0,3196
300251,Hyderabad,Night,non-stop,Night,Bangalore,Economy,1.08,26.0,2115
300252,Hyderabad,Morning,1-stop,Morning,Bangalore,Economy,2.42,26.0,3196
300253,Hyderabad,Night,non-stop,Night,Bangalore,Economy,1.08,26.0,2115
300254,Hyderabad,Night,non-stop,Night,Bangalore,Economy,1.08,26.0,2115

In [123]:
print(df_1["stops"].unique())

['zero' 'one' 'two_or_more' '1-stop' 'non-stop ']

In [124]:
city_dict = {}
ctr = 0
for i in np.sort(df_1["source_city"].unique()):
    city_dict[i] = ctr
    ctr += 1

time_dict = {
    "Late_Night":0,
    "Early_Morning":1,
    "Morning":2,
    "Afternoon":3,
    "Evening":4,
    "Night":5,
}


stops_dict = {
    "zero":0,
    "non-stop ":0,
    "one":1,
    "1-stop":1,
    "two_or_more":2
}

class_dict = {"Economy":0,"Business":1}

df_2 = df_1.copy()

df_2["source_city"] = df_2["source_city"].map(city_dict)
df_2["destination_city"] = df_2["destination_city"].map(city_dict)

df_2["stops"] = df_2["stops"].map(stops_dict)

df_2["departure_time"] = df_2["departure_time"].map(time_dict)
df_2["arrival_time"] = df_2["arrival_time"].map(time_dict)

df_2["class"] = df_2["class"].map(class_dict)

In [125]:
df_2

,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,2,4,0,5,5,0,2.17,1.0,5953
1,2,1,0,2,5,0,2.33,1.0,5953
2,2,1,0,1,5,0,2.17,1.0,5956
3,2,2,0,3,5,0,2.25,1.0,5955
4,2,2,0,2,5,0,2.33,1.0,5955
...,...,...,...,...,...,...,...,...,...
300250,3,2,1,2,0,0,2.42,26.0,3196
300251,3,5,0,5,0,0,1.08,26.0,2115
300252,3,2,1,2,0,0,2.42,26.0,3196
300253,3,5,0,5,0,0,1.08,26.0,2115
300254,3,5,0,5,0,0,1.08,26.0,2115

In [126]:
X = df_2.drop(columns="price")
y = df_2["price"]

In [127]:
X

,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left
0,2,4,0,5,5,0,2.17,1.0
1,2,1,0,2,5,0,2.33,1.0
2,2,1,0,1,5,0,2.17,1.0
3,2,2,0,3,5,0,2.25,1.0
4,2,2,0,2,5,0,2.33,1.0
...,...,...,...,...,...,...,...,...
300250,3,2,1,2,0,0,2.42,26.0
300251,3,5,0,5,0,0,1.08,26.0
300252,3,2,1,2,0,0,2.42,26.0
300253,3,5,0,5,0,0,1.08,26.0
300254,3,5,0,5,0,0,1.08,26.0

In [131]:
mms = MinMaxScaler()
X_res = pd.DataFrame(mms.fit_transform(X),columns=X.columns)
y_res = y.copy()